app/views/books/edit.html.erb

SELECT `authors`.* FROM `authors`
---
	  <%= f.label :author %> </br>
    <%= f.collection_select :author_id, Author.all, :id, :name %> </br></br>