app/controllers/accounts_controller.rb

	def create
		user = User.new(resource_params)
		user.save
---
INSERT INTO `users` (`name`, `username`, `password_digest`) VALUES ('saya', 'sayan', '$2a$12$ke6RstwRWB4l6Cg0izjKP.8uPfE/c2T4aUMrPEhjzqqsHH4oO/Ms6')