app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
	def current_user
		if session[:user_id] #jika user_id ada maka
			User.find(session[:user_id]) #kita bisa mengambil user id