app/controllers/books_controller.rb

  def index
  	@books = Book.all
---
SELECT `books`.* FROM `books`

    def show
      id = params[:id]
      @book = Book.find(id)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 7 LIMIT 1

  def create
    @book = Book.new (resource_params)
    if @book.save
---
INSERT INTO `books` (`about`, `created_at`, `updated_at`, `price`, `page`, `author_id`) VALUES ('kumpulan lagu anak kecil', '2020-09-30 07:41:53.236056', '2020-09-30 07:41:53.236056', 21, 21, 2)

  def edit
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 8 LIMIT 1

 def update
    @book = Book.find(params[:id])
    @book.update(resource_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 35 LIMIT 1
UPDATE `books` SET `books`.`about` = 'dn121 bsjajsa jdakdjak', `books`.`author_id` = 1, `books`.`updated_at` = '2020-09-30 08:07:50.580649' WHERE `books`.`id` = 37

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 48 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 48