app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'qwerty' LIMIT 1
---
	def create
		username = params[:username]
		password = params[:password]

		user = User.find_by(username: username)